set_db init_lib_search_path ../lib
set_db init_hdl_search_path ../rtl
set_db library fast.lib
read_hdl SAR_RTL.v
gui_sho
elaborate
read_vcd ../tb/traces.vcd
report_timing -unconstrained
report_power
report_area
syn_generic
syn_map
syn_opt
report_power
report_area
write_hdl >> ../tb/SAR_NL.v